STL_IGU_25_N4_AER2/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//JN: Here we define, which edges we want to use as features for the geometry. Usually we use all of them
surfaces
(
  "inlet1.stl"
  "inlet2.stl"
  "outlet.stl"
  "windowsmall.stl"
  "door.stl"
  "columns.stl"
  "windowbig.stl"
  "ceiling.stl"
  "floor.stl"
  "wallwindow.stl"
  "walldoor.stl"
  "walloutside.stl"
  "wallinside.stl"
  "emission_surface.stl"
  "n_001.stl"
  "n_002.stl"
  "n_003.stl"
  "n_004.stl"
);

includedAngle   180;


// ************************************************************************* //
